uart.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-26 Sun 12:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>uart serial</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">uart serial</h1>

<div id="outline-container-org0000002" class="outline-2">
<h2 id="org0000002"><span class="section-number-2">1.</span> repurposing a microcontroller as a serial adapter</h2>
<div class="outline-text-2" id="text-1">
<p>
don't want to buy a dedicated usb-to-serial converter? many
microcontrollers already have one built in! connecting the certain
pins allow disabling the processor, and then you can attach the RX/TX
lines to anything else as you please.
</p>
</div>

<div id="outline-container-org0000000" class="outline-3">
<h3 id="org0000000"><span class="section-number-3">1.1.</span> arduino uno (5v)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
connect the <code>RESET</code> pin to <code>GND</code> (ground)
</p>
</div>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.2.</span> nodemcu esp8266 (3.3v)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
connect the <code>EN</code> (enable) pin to <code>GND</code>
</p>
</div>
</div>
</div>
</div>
</body>
</html>